// *++
//
// Copyright (c) 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   PingStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell Ping command
// 
// Revision History:
// 
// --*/ 
/=#

#langdef eng "English"

#string STR_PING_INVALID_IP               #language eng  "%HPing%N: Invalid TargetIp, %hs\n"
#string STR_PING_INVALID_COUNT            #language eng  "%HPing%N: Invalid count, %hs\n"
#string STR_PING_INVALID_BUFFER_SIZE      #language eng  "%HPing%N: Invalid buffer size, %hs\n"
#string STR_PING_CONFIG_IP4               #language eng  "%HPing%N: Config Ip4 instance error, %hr\n"
#string STR_PING_MAPPING                  #language eng  "%HPing%N: Failed to get the default address.\n"
#string STR_PING_IP_TRANSMIT_ERROR        #language eng  "IP transmit error, %r\n"
#string STR_PING_TIMEOUT                  #language eng  "Request time out.\n"
#string STR_PING_REPLY_INFO               #language eng  "Reply from %d.%d.%d.%d: bytes=%d time%c%dms TTL=%d\n"
#string STR_PING_START                    #language eng  "Pinging %d.%d.%d.%d with %d bytes data:\n\n"
#string STR_PING_STAT_HEAD                #language eng  "\nPing statistics for %d.%d.%d.%d:\n"
#string STR_PING_STAT_DETAIL              #language eng  "  Packets: Sent = %d, Received = %d, Lost = %d (%d%% loss),\n"
#string STR_PING_RTT_HEAD                 #language eng  "Approximate round trip times in milli-seconds:\n"
#string STR_PING_RTT_DETAIL               #language eng  "  Minimum = %dms, Maximum = %dms, Average = %dms\n\n"
#string STR_PING_LINE_HELP                #language eng  "Ping a target machine with UEFI network stack"
#string STR_PING_HELP            #language eng  "\nUsage: Ping [-n count] [-l size] TargetIp\n"
                                                "Options:\n"
                                                "  -n count    Number of echo requests to send.\n"
                                                "  -l size     Send buffer size.\n"